sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/hci/controller/stm32wb05n_gatt_aci.c
      index_input += Gatt_Srv_Notify_Attr[i].Val_Length;
    }
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x138;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}
tBleStatus aci_gatt_clt_read_multiple_var_len_char_value(uint16_t Connection_Handle,
                                                         uint16_t CID,
                                                         uint8_t Number_of_Handles,
                                                         uint16_t Handle[])
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gatt_clt_read_multiple_var_len_char_value_cp0 *cp0 = (aci_gatt_clt_read_multiple_var_len_char_value_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Connection_Handle = htob(Connection_Handle, 2);
  index_input += 2;
  cp0->CID = htob(CID, 2);
  index_input += 2;
  cp0->Number_of_Handles = htob(Number_of_Handles, 1);
  index_input += 1;
  /* var_len_data input */
  {
    STM32WB_memcpy((void *) &cp0->Handle, (const void *) Handle, Number_of_Handles*sizeof(uint16_t));
    index_input += Number_of_Handles*sizeof(uint16_t);
  }
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x139;
  rq.event = 0x0F;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

tBleStatus aci_gatt_clt_add_subscription_security_level_nwk(uint16_t Conn_Handle,
                                                            uint16_t Char_Value_Handle,
                                                            uint8_t Sec_Level)
{
  struct hci_request rq;
  uint8_t cmd_buffer[532];
  aci_gatt_clt_add_subscription_security_level_nwk_cp0 *cp0 = (aci_gatt_clt_add_subscription_security_level_nwk_cp0*)(cmd_buffer);
  tBleStatus status = 0;
  uint8_t index_input = 0;
  cp0->Conn_Handle = htob(Conn_Handle, 2);
  index_input += 2;
  cp0->Char_Value_Handle = htob(Char_Value_Handle, 2);
  index_input += 2;
  cp0->Sec_Level = htob(Sec_Level, 1);
  index_input += 1;
  STM32WB_memset(&rq, 0, sizeof(rq));
  rq.ext_aci = TRUE;
  rq.ogf = 0x3f;
  rq.ocf = 0x13a;
  rq.cparam = cmd_buffer;
  rq.clen = index_input;
  rq.rparam = &status;
  rq.rlen = 1;
  if (hci_send_req(&rq, FALSE) < 0)
    return BLE_STATUS_TIMEOUT;
  if (status) {
    return status;
  }
  return BLE_STATUS_SUCCESS;
}

